CREATE EXTENSION IF NOT EXISTS pgcrypto;

INSERT INTO "user"
    (name, user_tag, birth_date, description, avatar_url)
VALUES
    ('Ультра Гигачелов', 'ultra_giga',DATE '2005-03-14', 'Люблю мою крутую девушку', NULL),
ON CONFLICT (user_tag) DO NOTHING;

INSERT INTO password (user_id, password_hash)
VALUES
    (1, crypt('qwerty123',  gen_salt('bf', 10))),
ON CONFLICT (user_id) DO NOTHING;


INSERT INTO pin (creator_id, image_url, name, description)
VALUES
    (1, 'pin01.jpg', 'Стоковое фото 1', 'Абсолютная имба'),
    (1, 'pin02.jpg', 'Стоковое фото 2', 'невероятная кайфуха'),
    (1, 'pin03.jpg', 'Стоковое фото 3', 'Лютейшая невероятность'),
    (1, 'pin04.jpg', 'Стоковое фото 4', 'Кринжатина'),
    (1, 'pin05.jpg', 'Стоковое фото 5', 'Чел, ну да'),

    (1, 'pin06.jpg', 'Стоковое фото 6', 'Ну см кем не бывает ^:P'),
    (1, 'pin07.jpg', 'Стоковое фото 7', 'модерн...'),
    (1, 'pin08.jpg', 'Стоковое фото 8', 'Неее, это лишнее'),
    (1, 'pin09.jpg', 'Стоковое фото 9', 'Просто отврат'),
    (1, 'pin10.jpg', 'Стоковое фото 10', 'моё любимое фото меня и моей кошечки'),

    (1, 'pin11.jpg', 'Стоковое фото 11', 'Чья-то бабуля?'),
    (1, 'pin12.jpg', 'Стоковое фото 12', 'Ужас кринжвиля'),
    (1, 'pin13.jpg', 'Стоковое фото 13', 'Жёсткий замес'),
    (1, 'pin14.jpg', 'Стоковое фото 14', 'Человеческое фото'),
    (1, 'pin15.jpg', 'Стоковое фото 15', 'Кончаются идеи'),

    (1, 'pin16.jpg', 'Стоковое фото 16', 'Разнос'),
    (1, 'pin17.jpg', 'Стоковое фото 17', 'Стоило подумать об этом...'),
    (1, 'pin18.jpg', 'Стоковое фото 18', 'Да сколько можно-то?!'),
    (1, 'pin19.jpg', 'Стоковое фото 19', 'Пишу это ручками, а лучше бы делом занялся'),
    (1, 'pin20.jpg', 'Стоковое фото 20', 'Крутейшя крутость яйцо в крутую без регистрации и смс'),

    (1, 'pin21.jpg', 'Стоковое фото 21', 'Мой любимый сериал'),
    (1, 'pin22.jpg', 'Стоковое фото 22', 'Сальса в пятнциу вечером'),
    (1, 'pin23.jpg', 'Стоковое фото 23', 'Дорогая, у нас тройня'),
    (1, 'pin24.jpg', 'Стоковое фото 24', 'как много стоковых фоток'),
    (1, 'pin25.jpg', 'Стоковое фото 25', 'Ужасно мило'),

    (1, 'pin26.jpg', 'Стоковое фото 26', 'Мой любимый праздник'),
    (1, 'pin27.jpg', 'Стоковое фото 27', 'Это ты мне?!'),
    (1, 'pin28.jpg', 'Стоковое фото 28', 'Предпредпоследнее описание'),
    (1, 'pin29.jpg', 'Стоковое фото 29', 'Ну нет, ну пожалуйста, нееет'),
    (1, 'pin30.jpg', 'Стоковое фото 30', 'О да, наконец');
ON CONFLICT (image_url) DO NOTHING;
